# 시뮬레이션 및 완전 탐색 문제에서는 2차원 공간에서의 방향 벡터가 자주 활용된다.
#       동, 북, 서, 남
# dx = [0, -1, 0, 1]
# dy = [1, 0, -1, 0]
# x, y = 2, 2
# for i in range(4):
#     nx = x + dx[i]
#     ny = y + dy[i]
#     print(nx, ny)

# <문제> 상하좌우
# 여행가 A는 N * N 크기의 정사각형 공간 위에 서 있습니다. 이 공간은 1 * 1 크기의 정사각형으로 나누어져 있습니다. 가장 왼쪽 위 좌표는 (1,1)이며, 가장 오른쪽 아래 좌표는 (N,N)에 해당합니다.
# 여행가 A는 상,하,좌,우 방향으로 이동할 수 있으며, 시작 좌표는 항상 (1,1)입니다. 우리 앞에는 여행가 A가 이동할 계획이 저힌 계획서가 놓여 있습니다.
# 계획서에는 하나의 줄에 띄어쓰기를 기준으로 하여 L,R,U,D 중 하나의 문자가 반복적으로 적혀 있습니다. 각 문자의 의미는 다음과 같습니다.
# L : 왼쪽으로 한 칸 이동 , R : 오른쪽으로 한 칸 이동 , U : 위로 한 칸 이동 , D : 아래로 한 칸 이동
# 이때 여행가 A가 N * N 크기의 정사각형 공간을 벗어나는 움직임은 무시됩니다. 예를 들어 (1,1)의 위치에서 L 혹은 U 를 만나면 무시됩니다. 다음은 N = 5인 지도와 계획서입니다.
# (1,1) 에서 시작하여 R->R->R->U->D->D 움직이면 위치하는 곳은?
# <입력> 첫째 줄에 공간의 크기를 나타내는 N이 주어집니다. ( 1<=N<=100 )
# 둘째 줄에 여행가 A가 이동할 계획서 내용이 주어집니다. ( 1<=이동횟수<=100 )
# <출력> 첫째 줄에 여행가 A가 최종적으로 도착할 지점의 좌표 (X,Y)를 공백을 기준을 구분하여 출렵합니다.

# <내 풀이>
n = int(input())
plan = input().split()

dx = [0, 0, -1, 1]
dy = [-1, 1, 0, 0]
y, x = 1, 1

for i in range(len(plan)):
    load = plan[i]
    if load == 'L' and n>x+dx[2]>0 and n>y+dy[2]>0:
        x += dx[2]
        y += dy[2]
    elif load == 'R' and n>x+dx[3]>0 and n>y+dy[3]>0:
        x += dx[3]
        y += dy[3]
    elif load == 'U' and n>+dx[0]>0 and n>y+dy[0]>0:
        x += dx[0]
        y += dy[0]
    elif load == 'D' and n>x+dx[1]>0 and n>y+dy[1]>0:
        x += dx[1]
        y += dy[1]

print(y, x)

# <해결 아이디어> *시뮬레이션 유형으로도 분류되며 요구사항대로 충실히 구현하면 된다.
n = int(input())
x, y = 1, 1
plans = input().split()

# L, R, U, D에 따른 이동 방향
dx = [0, 0, -1, 1]
dy = [-1, 1, 0, 0]
move_types = ['L', 'R', 'U', 'D']

# 이동 계획을 하나씩 확인하기
for plan in plans:
    # 이동 후 좌표 구하기
    for i in range(len(move_types)):
        if plan==move_types[i]:
            nx = x + dx[i]
            ny = y + dy[i]
        # 공간을 벗어나는 경우 무시
        if nx < 1 or ny < 1 or nx > n or ny > n:
            continue
        # 이동 수행
        x, y = nx, ny

print(x, y)

# <추가> x, y 좌표의 기준을 잘 확인하기
